<a href="https://colab.research.google.com/github/Navyashreecs/Navyashreecs/blob/main/task2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#printing info of Chocolate.csv
import numpy as np
import pandas as pd
df=pd.read_csv("Chocolate.csv")
print(df)

    index    Brand CoverColor    Fat  ...  Variants  Sugar quantity  price
0       0   Nestle        Red  22.40  ...      four  30.00       21   1234
1       1  Cadbury     Purple  12.40  ...     three  32.40       21   2345
2       2   Nestle        Red  45.60  ...       one  40.50       19   1800
3       3  Cadbury     Purple  23.00  ...       six  50.20       24   1700
4       4   Nestle        Red  13.00  ...       six  32.50       18   1550
5       5  Cadbury     Purple  45.20  ...       six  31.50       27   1359
6       6  Cadbury     Purple  23.33  ...      four  43.70       37   1200
7       7   Nestle        Red  12.90  ...     three  41.90       26   1530
8       8     Amul      Brown  14.50  ...       two  33.34       23   1980
9       9   Nestle        Red  22.40  ...       one  21.34       23   1240
10     10   Nestle        Red  32.10  ...     three  33.30       41   1290
11     11   Nestle        Red  12.70  ...       six  33.90       17   1350
12     12     Amul      Brown  11.10  ...      four  43.10       19   1675
13     13  Cadbury     Purple  19.50  ...      five  42.10       15   1100
14     14     Amul      Brown  17.30  ...       two  45.70       23   1300
15     15   Nestle        Red  17.80  ...       one  34.20       26   1500
16     16     Amul      Brown  18.50  ...       six  12.50       29   2300
17     17  Cadbury     Purple  20.23  ...      five  23.90       31   2450
18     18   Nestle        Red  23.15  ...      four  11.50       33   2480
19     19   Nestle        Red  40.20  ...       two  22.22       37   4000
20     20     Amul      Brown  22.50  ...     three  20.00       21   2345
21     21  Cadbury     Purple  16.40  ...     three  18.00       19   3200
22     22     Amul      Brown  16.98  ...      five  19.76       17   1278
23     23     Amul      Brown  13.60  ...     three  19.54       15   1480
24     24   Nestle        Red  19.40  ...       two  21.70       13   2310
25     25     Amul      Brown  21.30  ...       six  26.70       12   2450
26     26     Amul      Brown  20.00  ...      four  25.40       15   3210
27     27  Cadbury     Purple  11.14  ...      five  29.00       21   3620
28     28     Amul      Brown   9.50  ...      four  31.60       27   4110
29     29   Nestle        Red   5.70  ...      five  31.80       23   3110
30     30     Amul      Brown  19.70  ...       two  34.60       32   2320
31     31  Cadbury     Purple  18.99  ...     three  37.90       37   2020
32     31     Amul      Brown  15.50  ...       six  41.40       21   3010
33     33   Nestle        Red  13.70  ...      four  31.20       34   2000
34     34     Amul      Brown  14.20  ...       one  22.50       38   1999
35     35  Cadbury     Purple  12.10  ...      five  39.00       21   1870
36     36     Amul      Brown  15.70  ...       six  40.20       24   3210
37     37     Amul      Brown  19.50  ...      five  23.00       31   1450
38     38   Nestle        Red  23.40  ...      five  21.50       33   2210
39     39   Nestle        Red  25.12  ...     three  25.30       17   2400
40     40     Amul      Brown  19.80  ...      four  19.00       19   2100

[41 rows x 10 columns]

In [ ]:
#Sorting of chocolates by price
df.sort_values(["price"],
              axis=0,
              ascending=[True],
              inplace=True)
print(df)

    index    Brand CoverColor    Fat  ...  Variants  Sugar quantity  price
13     13  Cadbury     Purple  19.50  ...      five  42.10       15   1100
6       6  Cadbury     Purple  23.33  ...      four  43.70       37   1200
0       0   Nestle        Red  22.40  ...      four  30.00       21   1234
9       9   Nestle        Red  22.40  ...       one  21.34       23   1240
22     22     Amul      Brown  16.98  ...      five  19.76       17   1278
10     10   Nestle        Red  32.10  ...     three  33.30       41   1290
14     14     Amul      Brown  17.30  ...       two  45.70       23   1300
11     11   Nestle        Red  12.70  ...       six  33.90       17   1350
5       5  Cadbury     Purple  45.20  ...       six  31.50       27   1359
37     37     Amul      Brown  19.50  ...      five  23.00       31   1450
23     23     Amul      Brown  13.60  ...     three  19.54       15   1480
15     15   Nestle        Red  17.80  ...       one  34.20       26   1500
7       7   Nestle        Red  12.90  ...     three  41.90       26   1530
4       4   Nestle        Red  13.00  ...       six  32.50       18   1550
12     12     Amul      Brown  11.10  ...      four  43.10       19   1675
3       3  Cadbury     Purple  23.00  ...       six  50.20       24   1700
2       2   Nestle        Red  45.60  ...       one  40.50       19   1800
35     35  Cadbury     Purple  12.10  ...      five  39.00       21   1870
8       8     Amul      Brown  14.50  ...       two  33.34       23   1980
34     34     Amul      Brown  14.20  ...       one  22.50       38   1999
33     33   Nestle        Red  13.70  ...      four  31.20       34   2000
31     31  Cadbury     Purple  18.99  ...     three  37.90       37   2020
40     40     Amul      Brown  19.80  ...      four  19.00       19   2100
38     38   Nestle        Red  23.40  ...      five  21.50       33   2210
16     16     Amul      Brown  18.50  ...       six  12.50       29   2300
24     24   Nestle        Red  19.40  ...       two  21.70       13   2310
30     30     Amul      Brown  19.70  ...       two  34.60       32   2320
20     20     Amul      Brown  22.50  ...     three  20.00       21   2345
1       1  Cadbury     Purple  12.40  ...     three  32.40       21   2345
39     39   Nestle        Red  25.12  ...     three  25.30       17   2400
17     17  Cadbury     Purple  20.23  ...      five  23.90       31   2450
25     25     Amul      Brown  21.30  ...       six  26.70       12   2450
18     18   Nestle        Red  23.15  ...      four  11.50       33   2480
32     31     Amul      Brown  15.50  ...       six  41.40       21   3010
29     29   Nestle        Red   5.70  ...      five  31.80       23   3110
21     21  Cadbury     Purple  16.40  ...     three  18.00       19   3200
36     36     Amul      Brown  15.70  ...       six  40.20       24   3210
26     26     Amul      Brown  20.00  ...      four  25.40       15   3210
27     27  Cadbury     Purple  11.14  ...      five  29.00       21   3620
19     19   Nestle        Red  40.20  ...       two  22.22       37   4000
28     28     Amul      Brown   9.50  ...      four  31.60       27   4110

[41 rows x 10 columns]

In [ ]:
#print the top 5 and last 5 rows
print(df.head(5),
      df.tail(5))

    index    Brand CoverColor    Fat  ...  Variants  Sugar quantity  price
13     13  Cadbury     Purple  19.50  ...      five  42.10       15   1100
6       6  Cadbury     Purple  23.33  ...      four  43.70       37   1200
0       0   Nestle        Red  22.40  ...      four  30.00       21   1234
9       9   Nestle        Red  22.40  ...       one  21.34       23   1240
22     22     Amul      Brown  16.98  ...      five  19.76       17   1278

[5 rows x 10 columns]     index    Brand CoverColor    Fat  ...  Variants  Sugar quantity  price
36     36     Amul      Brown  15.70  ...       six  40.20       24   3210
26     26     Amul      Brown  20.00  ...      four  25.40       15   3210
27     27  Cadbury     Purple  11.14  ...      five  29.00       21   3620
19     19   Nestle        Red  40.20  ...       two  22.22       37   4000
28     28     Amul      Brown   9.50  ...      four  31.60       27   4110

[5 rows x 10 columns]

In [ ]:
#print the brand,price,type,quantity of expensive choclates
z=df[df["price"]==df["price"].max()]
df_100=pd.DataFrame(z)
print(df_100[['Brand','price','type','quantity']])

   Brand  price   type  quantity
28  Amul   4110  White        27

In [ ]:
#print details of cadbury choc
print(df[df['Brand']=='Cadbury'])

    index    Brand CoverColor    Fat  ...  Variants Sugar quantity  price
13     13  Cadbury     Purple  19.50  ...      five  42.1       15   1100
6       6  Cadbury     Purple  23.33  ...      four  43.7       37   1200
5       5  Cadbury     Purple  45.20  ...       six  31.5       27   1359
3       3  Cadbury     Purple  23.00  ...       six  50.2       24   1700
35     35  Cadbury     Purple  12.10  ...      five  39.0       21   1870
31     31  Cadbury     Purple  18.99  ...     three  37.9       37   2020
1       1  Cadbury     Purple  12.40  ...     three  32.4       21   2345
17     17  Cadbury     Purple  20.23  ...      five  23.9       31   2450
21     21  Cadbury     Purple  16.40  ...     three  18.0       19   3200
27     27  Cadbury     Purple  11.14  ...      five  29.0       21   3620

[10 rows x 10 columns]

In [ ]:
#Counting num of choc of each brand
x=df['Brand'].value_counts()
print(x)
print(x.max())

Amul       16
Nestle     15
Cadbury    10
Name: Brand, dtype: int64
16

In [ ]:
#Finding the expensive chocolate under each brand.
val=df.groupby("Brand")
print(val['price'].max())

Brand
Amul       4110
Cadbury    3620
Nestle     4000
Name: price, dtype: int64

In [ ]:
#Avg quantity of each brand
val=df.groupby("Brand")
print(val['quantity'].mean())

Brand
Amul       22.875
Cadbury    25.300
Nestle     25.400
Name: quantity, dtype: float64

In [ ]:
import numpy as np
import pandas as pd
df3=pd.read_csv("admissions.csv")
print(df3)

         Name  ID_Number  ... AmountToBePaid  AmountPaid
0       Davis       1001  ...          10000      5000.0
1      Srijan       1002  ...          10000      3000.0
2      Ishita       1003  ...           8000      2000.0
3      Ananya       1004  ...          10000         NaN
4      Namish       1005  ...          15000      8000.0
5       Rohan       1006  ...          10000     10000.0
6     Mithali       1007  ...          12000      8000.0
7     Shirley       1008  ...           8000      4500.0
8     Madilyn       1009  ...          15000      5500.0
9     Lavanya       1010  ...           8000      7500.0
10  Priyanshu       1011  ...          10000         NaN
11   Vanshika       1012  ...          12000     12000.0
12     Dhrish       1013  ...          10000      4000.0
13        Dia       1014  ...           8000      5000.0
14     Khushi       1015  ...           8000      8000.0
15      Navya       1016  ...           8000      4550.0
16     Preeti       1017  ...          15000     10000.0
17      Sanav       1018  ...          10000         NaN
18      Sanvi       1019  ...          12000      9000.0
19      Jatin       1020  ...          12000      9800.0

[20 rows x 9 columns]

In [ ]:
#read the file admission & print top 5 rows
print(df3.head(5))

     Name  ID_Number   Place  ...  CourseEnrolled AmountToBePaid AmountPaid
0   Davis       1001     UAE  ...              Py          10000     5000.0
1  Srijan       1002   India  ...              Py          10000     3000.0
2  Ishita       1003   India  ...              WD           8000     2000.0
3  Ananya       1004  Europe  ...              Py          10000        NaN
4  Namish       1005     USA  ...              AI          15000     8000.0

[5 rows x 9 columns]

In [ ]:
#array of the given values & add a GENDER column to dataframe
gender=np.array(['M','M','F','F','M','M','F','F','F','F','M','F','M','F','F','F','F','M','F','M'])
df6=pd.DataFrame()
df6['gender']=gender
print(df6)

   gender
0       M
1       M
2       F
3       F
4       M
5       M
6       F
7       F
8       F
9       F
10      M
11      F
12      M
13      F
14      F
15      F
16      F
17      M
18      F
19      M

In [ ]:
#check if there is null values 
df6=df3['AmountPaid']
df6.isnull().sum()

3

In [ ]:
#Replacing null values by zero
df3['AmountPaid'].fillna(0,inplace=True)
df3

         Name  ID_Number  ... AmountToBePaid  AmountPaid
0       Davis       1001  ...          10000      5000.0
1      Srijan       1002  ...          10000      3000.0
2      Ishita       1003  ...           8000      2000.0
3      Ananya       1004  ...          10000         0.0
4      Namish       1005  ...          15000      8000.0
5       Rohan       1006  ...          10000     10000.0
6     Mithali       1007  ...          12000      8000.0
7     Shirley       1008  ...           8000      4500.0
8     Madilyn       1009  ...          15000      5500.0
9     Lavanya       1010  ...           8000      7500.0
10  Priyanshu       1011  ...          10000         0.0
11   Vanshika       1012  ...          12000     12000.0
12     Dhrish       1013  ...          10000      4000.0
13        Dia       1014  ...           8000      5000.0
14     Khushi       1015  ...           8000      8000.0
15      Navya       1016  ...           8000      4550.0
16     Preeti       1017  ...          15000     10000.0
17      Sanav       1018  ...          10000         0.0
18      Sanvi       1019  ...          12000      9000.0
19      Jatin       1020  ...          12000      9800.0

[20 rows x 9 columns]

In [ ]:
#'AmountBalance' column which has to pay
df3['AmountBalance']=df3['AmountToBePaid'].sub(df3['AmountPaid'],axis=0)
print(df3)

         Name  ID_Number  ... AmountPaid  AmountBalance
0       Davis       1001  ...     5000.0         5000.0
1      Srijan       1002  ...     3000.0         7000.0
2      Ishita       1003  ...     2000.0         6000.0
3      Ananya       1004  ...        0.0        10000.0
4      Namish       1005  ...     8000.0         7000.0
5       Rohan       1006  ...    10000.0            0.0
6     Mithali       1007  ...     8000.0         4000.0
7     Shirley       1008  ...     4500.0         3500.0
8     Madilyn       1009  ...     5500.0         9500.0
9     Lavanya       1010  ...     7500.0          500.0
10  Priyanshu       1011  ...        0.0        10000.0
11   Vanshika       1012  ...    12000.0            0.0
12     Dhrish       1013  ...     4000.0         6000.0
13        Dia       1014  ...     5000.0         3000.0
14     Khushi       1015  ...     8000.0            0.0
15      Navya       1016  ...     4550.0         3450.0
16     Preeti       1017  ...    10000.0         5000.0
17      Sanav       1018  ...        0.0        10000.0
18      Sanvi       1019  ...     9000.0         3000.0
19      Jatin       1020  ...     9800.0         2200.0

[20 rows x 10 columns]

In [ ]:
#Sorting of df's columns in descending order
df3.sort_values(['Name'],axis=0,ascending=False,inplace=True)
print(df3)

         Name  ID_Number  ... AmountPaid  AmountBalance
11   Vanshika       1012  ...    12000.0            0.0
1      Srijan       1002  ...     3000.0         7000.0
7     Shirley       1008  ...     4500.0         3500.0
18      Sanvi       1019  ...     9000.0         3000.0
17      Sanav       1018  ...        0.0        10000.0
5       Rohan       1006  ...    10000.0            0.0
10  Priyanshu       1011  ...        0.0        10000.0
16     Preeti       1017  ...    10000.0         5000.0
15      Navya       1016  ...     4550.0         3450.0
4      Namish       1005  ...     8000.0         7000.0
6     Mithali       1007  ...     8000.0         4000.0
8     Madilyn       1009  ...     5500.0         9500.0
9     Lavanya       1010  ...     7500.0          500.0
14     Khushi       1015  ...     8000.0            0.0
19      Jatin       1020  ...     9800.0         2200.0
2      Ishita       1003  ...     2000.0         6000.0
13        Dia       1014  ...     5000.0         3000.0
12     Dhrish       1013  ...     4000.0         6000.0
0       Davis       1001  ...     5000.0         5000.0
3      Ananya       1004  ...        0.0        10000.0

[20 rows x 10 columns]

In [ ]:
#Count of students who have enrolled for each course
import seaborn
import matplotlib.pyplot as plt
fig=plt.figure(figsize=(20,30))
df3['COUNT']=df3.groupby('CourseEnrolled')['CourseEnrolled'].transform('count')
print(df3)

         Name  ID_Number        Place  ...  AmountPaid AmountBalance COUNT
11   Vanshika       1012          UAE  ...     12000.0           0.0     4
1      Srijan       1002        India  ...      3000.0        7000.0     7
7     Shirley       1008    Australia  ...      4500.0        3500.0     6
18      Sanvi       1019        India  ...      9000.0        3000.0     4
17      Sanav       1018        India  ...         0.0       10000.0     7
5       Rohan       1006       Europe  ...     10000.0           0.0     7
10  Priyanshu       1011  Phillipines  ...         0.0       10000.0     7
16     Preeti       1017  Phillipines  ...     10000.0        5000.0     3
15      Navya       1016          USA  ...      4550.0        3450.0     6
4      Namish       1005          USA  ...      8000.0        7000.0     3
6     Mithali       1007       Europe  ...      8000.0        4000.0     4
8     Madilyn       1009          USA  ...      5500.0        9500.0     3
9     Lavanya       1010  Phillipines  ...      7500.0         500.0     6
14     Khushi       1015       Europe  ...      8000.0           0.0     6
19      Jatin       1020          UAE  ...      9800.0        2200.0     4
2      Ishita       1003        India  ...      2000.0        6000.0     6
13        Dia       1014    Australia  ...      5000.0        3000.0     6
12     Dhrish       1013    Australia  ...      4000.0        6000.0     7
0       Davis       1001          UAE  ...      5000.0        5000.0     7
3      Ananya       1004       Europe  ...         0.0       10000.0     7

[20 rows x 11 columns]